learning-java-ecosystem/learning-java-concurrency/Concurrency Test Thread Group.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.1 r1853635">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <stringProp pName="TestPlan.comments"></stringProp>
      <boolProp pName="TestPlan.functional_mode">false</boolProp>
      <boolProp pName="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp pName="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp pName="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp pName="Arguments.arguments"/>
      </elementProp>
      <stringProp pName="TestPlan.user_define_classpath"></stringProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Concurrency Test Thread Group" enabled="true">
        <stringProp pName="TestPlan.comments">Concurrency Test</stringProp>
        <stringProp pName="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp pName="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp pName="LoopController.continue_forever">false</boolProp>
          <stringProp pName="LoopController.loops">20</stringProp>
        </elementProp>
        <stringProp pName="ThreadGroup.num_threads">50</stringProp>
        <stringProp pName="ThreadGroup.ramp_time">1</stringProp>
        <boolProp pName="ThreadGroup.scheduler">false</boolProp>
        <stringProp pName="ThreadGroup.duration"></stringProp>
        <stringProp pName="ThreadGroup.delay"></stringProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Test Request" enabled="true">
          <elementProp pName="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
            <collectionProp pName="Arguments.arguments"/>
          </elementProp>
          <stringProp pName="HTTPSampler.domain">localhost</stringProp>
          <stringProp pName="HTTPSampler.port">8080</stringProp>
          <stringProp pName="HTTPSampler.protocol"></stringProp>
          <stringProp pName="HTTPSampler.contentEncoding">UTF-8</stringProp>
          <stringProp pName="HTTPSampler.path">/concurrency/test</stringProp>
          <stringProp pName="HTTPSampler.method">GET</stringProp>
          <boolProp pName="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp pName="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp pName="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp pName="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
          <stringProp pName="HTTPSampler.embedded_url_re"></stringProp>
          <stringProp pName="HTTPSampler.connect_timeout"></stringProp>
          <stringProp pName="HTTPSampler.response_timeout"></stringProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp pName="ResultCollector.error_logging">false</boolProp>
            <objProp>
              <pName>saveConfig</pName>
              <value class="SampleSaveConfiguration">
                <time>true</time>
                <latency>true</latency>
                <timestamp>true</timestamp>
                <success>true</success>
                <label>true</label>
                <code>true</code>
                <message>true</message>
                <threadName>true</threadName>
                <dataType>true</dataType>
                <encoding>false</encoding>
                <assertions>true</assertions>
                <subresults>true</subresults>
                <responseData>false</responseData>
                <samplerData>false</samplerData>
                <xml>false</xml>
                <fieldNames>true</fieldNames>
                <responseHeaders>false</responseHeaders>
                <requestHeaders>false</requestHeaders>
                <responseDataOnError>false</responseDataOnError>
                <saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage>
                <assertionsResultsToSave>0</assertionsResultsToSave>
                <bytes>true</bytes>
                <sentBytes>true</sentBytes>
                <url>true</url>
                <threadCounts>true</threadCounts>
                <idleTime>true</idleTime>
                <connectTime>true</connectTime>
              </value>
            </objProp>
            <stringProp pName="filename"></stringProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="GraphVisualizer" testclass="ResultCollector" testname="Graph Results" enabled="true">
            <boolProp pName="ResultCollector.error_logging">false</boolProp>
            <objProp>
              <pName>saveConfig</pName>
              <value class="SampleSaveConfiguration">
                <time>true</time>
                <latency>true</latency>
                <timestamp>true</timestamp>
                <success>true</success>
                <label>true</label>
                <code>true</code>
                <message>true</message>
                <threadName>true</threadName>
                <dataType>true</dataType>
                <encoding>false</encoding>
                <assertions>true</assertions>
                <subresults>true</subresults>
                <responseData>false</responseData>
                <samplerData>false</samplerData>
                <xml>false</xml>
                <fieldNames>true</fieldNames>
                <responseHeaders>false</responseHeaders>
                <requestHeaders>false</requestHeaders>
                <responseDataOnError>false</responseDataOnError>
                <saveAssertionResultsFailureMessage>true</saveAssertionResultsFailureMessage>
                <assertionsResultsToSave>0</assertionsResultsToSave>
                <bytes>true</bytes>
                <sentBytes>true</sentBytes>
                <url>true</url>
                <threadCounts>true</threadCounts>
                <idleTime>true</idleTime>
                <connectTime>true</connectTime>
              </value>
            </objProp>
            <stringProp pName="filename"></stringProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>